{
  "movies": [
    {
      "id": 1,
      "name": "Spider-Man: No Way Home",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154219352124559530/Spider_Man_No_Way_Home-642739124-large.jpg?width=414&height=615",
      "length": "148",
      "genre": ["Acción", "Aventura", "Fantasía"],
      "description": "Spider-Man: No Way Home es una emocionante película de superhéroes que sigue a Peter Parker mientras se enfrenta a desafíos interdimensionales. Con la ayuda de viejos y nuevos amigos, Spider-Man lucha contra villanos de diferentes realidades para salvar su mundo. Esta película está llena de acción trepidante, efectos visuales sorprendentes y un viaje emocional que mantendrá a los espectadores al borde de sus asientos."
    },
    {
      "id": 2,
      "name": "Titanic",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154219586481307730/19870073.jpg?width=434&height=615",
      "length": "194",
      "genre": ["Drama", "Romance"],
      "description": "Titanic es un épico drama romántico que narra la trágica historia de amor entre Jack y Rose, dos pasajeros a bordo del icónico Titanic. La película explora su apasionada relación mientras el lujoso barco se hunde en el Atlántico Norte. Con una duración de casi tres horas, Titanic te sumergirá en una historia de amor inolvidable y una catástrofe marítima que cambió la historia."
    },
    {
      "id": 3,
      "name": "El Rey León",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154220039717789716/image_8b5ca578.jpeg?width=410&height=615",
      "length": "118",
      "genre": ["Animación", "Aventura", "Drama"],
      "description": "El Rey León es una película animada de Disney que sigue la vida de Simba, un joven león destinado a convertirse en rey. Después de un trágico evento, Simba se embarca en un viaje para reclamar su lugar como líder de la manada. Esta conmovedora película te llevará a la sabana africana, donde descubrirás la importancia del amor, la amistad y el legado."
    },
    {
      "id": 4,
      "name": "Toy Story",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154220454547050556/Toy_Story_4_Poster_4.png?width=415&height=615",
      "length": "100",
      "genre": ["Animación", "Comedia", "Romántica", "Aventura", "Comedia", "Infantil"],
      "description": "Toy Story es una película de animación que da vida a los juguetes cuando los humanos no los están mirando. Sigue las aventuras de Woody y Buzz Lightyear mientras intentan regresar a casa después de un inesperado viaje. Con un toque de romance y mucha comedia, esta película es un viaje emocionante para niños y adultos por igual."
    },
    {
      "id": 5,
      "name": "Avatar: The way of the Water",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154220743052247080/MV5BYjhiNjBlODctY2ZiOC00YjVlLWFlNzAtNTVhNzM1YjI1NzMxXkEyXkFqcGdeQXVyMjQxNTE1MDA._V1__1.jpg?width=866&height=1242",
      "length": "192",
      "genre": ["Ciencia ficción", "Aventura", "Acción", "Fantasía", "Animación"],
      "description": "Avatar: The way of the Water es una emocionante película de ciencia ficción que nos lleva de regreso al mundo de Pandora. La película sigue a los personajes en una búsqueda para proteger su hogar de una nueva amenaza. Con una duración de casi tres horas, esta película te sumergirá en un universo exuberante y lleno de maravillas, repleto de aventuras y efectos visuales deslumbrantes."
    },
    {
      "id": 6,
      "name": "Avengers: Endgame",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608713647271967/MV5BMTc5MDE2ODcwNV5BMl5BanBnXkFtZTgwMzI2NzQ2NzM._V1_.jpg?width=828&height=1228",
      "length": "181",
      "genre": ["Acción", "Aventura", "Ciencia ficción"],
      "description": "Avengers: Endgame es la culminación de la saga de superhéroes de Marvel. Los Vengadores se unen en un último esfuerzo para derrotar a Thanos y restaurar el equilibrio en el universo. Con una duración de más de tres horas, esta película te sumergirá en un emocionante viaje lleno de acción, drama y momentos épicos que dejarán una impresión duradera."
    },
    {
      "id": 7,
      "name": "The Lord of the Rings: The Fellowship of the Ring",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608710111465573/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY._V1_FMjpg_UX1000_.jpg?width=828&height=1228",
      "length": "178",
      "genre": ["Aventura", "Fantasía"],
      "description": "The Lord of the Rings: The Fellowship of the Ring es la primera entrega de la épica trilogía basada en la obra maestra de J.R.R. Tolkien. La película sigue a un grupo de personajes mientras se embarcan en una peligrosa misión para destruir un poderoso anillo. Con casi tres horas de duración, esta película te sumergirá en un mundo de fantasía inmersivo y una emocionante búsqueda épica."
    },
    {
      "id": 8,
      "name": "Inception",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608713055879218/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw._V1_.jpg?width=828&height=1226",
      "length": "148",
      "genre": ["Acción", "Ciencia ficción"],
      "description": "Inception es un fascinante thriller de ciencia ficción que explora el mundo de los sueños y la realidad. La película sigue a Dom Cobb, un ladrón de ideas, en una misión para implantar una idea en la mente de alguien. Con una trama intrincada y una duración de casi dos horas y media, Inception te desafiará a cuestionar la naturaleza de la realidad."
    },
    {
      "id": 9,
      "name": "Jurassic Park",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608713336885328/MV5BMjM2MDgxMDg0Nl5BMl5BanBnXkFtZTgwNTM2OTM5NDE._V1_.jpg?width=818&height=1228",
      "length": "127",
      "genre": ["Acción", "Aventura", "Ciencia ficción"],
      "description": "Jurassic Park es un emocionante thriller de ciencia ficción que nos lleva a un parque temático lleno de dinosaurios reales. Cuando las criaturas escapan, un grupo de personas lucha por sobrevivir en la isla. Con una duración de poco más de dos horas, esta película te sumergirá en un mundo prehistórico lleno de peligros y asombro."
    },
    {
      "id": 10,
      "name": "The Shawshank Redemption",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608710379913317/MV5BNDE3ODcxYzMtY2YzZC00NmNlLWJiNDMtZDViZWM2MzIxZDYwXkEyXkFqcGdeQXVyNjAwNDUxODI._V1_FMjpg_UX1000_.jpg?width=818&height=1228",
      "length": "142",
      "genre": ["Drama"],
      "description": "The Shawshank Redemption es un poderoso drama que sigue la historia de Andy Dufresne, un hombre condenado injustamente a prisión. A lo largo de los años, Andy forja amistades y busca la redención. Con una duración de poco más de dos horas, esta película es una conmovedora exploración de la esperanza y la perseverancia."
    },
    {
      "id": 11,
      "name": "Interstellar",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608712191840337/MV5BZjdkOTU3MDktN2IxOS00OGEyLWFmMjktY2FiMmZkNWIyODZiXkEyXkFqcGdeQXVyMTMxODk2OTU._V1_.jpg?width=828&height=1228",
      "length": "169",
      "genre": ["Ciencia ficción", "Drama"],
      "description": "Interstellar es una épica película de ciencia ficción que sigue a un grupo de astronautas en un viaje interestelar para encontrar un nuevo hogar para la humanidad. Con una duración de casi tres horas, la película te llevará a través de agujeros de gusano y planetas distantes en un emocionante viaje cósmico que desafía la mente y el corazón."
    },
    {
      "id": 12,
      "name": "The Dark Knight",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608709079674971/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw._V1_.jpg?width=838&height=1240",
      "length": "152",
      "genre": ["Acción", "Drama", "Crimen"],
      "description": "The Dark Knight es un thriller de acción que sigue la lucha del Batman contra el Joker, un villano despiadado. Con una duración de poco más de dos horas, la película te sumergirá en un mundo oscuro y caótico, donde la moralidad se pone a prueba y el caos se desata en las calles de Gotham City."
    },
    {
      "id": 13,
      "name": "Pirates of the Caribbean: The Curse of the Black Pearl",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608710656725092/MV5BNGYyZGM5MGMtYTY2Ni00M2Y1LWIzNjQtYWUzM2VlNGVhMDNhXkEyXkFqcGdeQXVyMTMxODk2OTU._V1_.jpg?width=824&height=1228",
      "length": "143",
      "genre": ["Acción", "Aventura", "Fantasía"],
      "description": "Pirates of the Caribbean: The Curse of the Black Pearl es una emocionante película de aventuras que sigue al Capitán Jack Sparrow en su búsqueda del tesoro maldito. Con una duración de poco más de dos horas, la película te llevará a través de batallas navales, intrigas y tesoros ocultos en un emocionante viaje pirata."
    },
    {
      "id": 14,
      "name": "The Matrix",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608711294271669/MV5BNzQzOTk3OTAtNDQ0Zi00ZTVkLWI0MTEtMDllZjNkYzNjNTc4L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY._V1_.jpg?width=816&height=1226",
      "length": "136",
      "genre": ["Acción", "Ciencia ficción"],
      "description": "The Matrix es un innovador thriller de ciencia ficción que sigue a Neo mientras descubre la verdad detrás de la realidad que conoce. Con una duración de poco más de dos horas, la película te sumergirá en un mundo de realidad virtual, luchas épicas y una lucha por la libertad en un futuro distópico."
    },
    {
      "id": 15,
      "name": "The Grand Budapest Hotel",
      "photo": "https://media.discordapp.net/attachments/1154210086512758835/1154608709742379140/MV5BMzM5NjUxOTEyMl5BMl5BanBnXkFtZTgwNjEyMDM0MDE._V1_.jpg?width=828&height=1228",
      "length": "99",
      "genre": ["Comedia", "Drama"],
      "description": "The Grand Budapest Hotel es una extravagante comedia dramática que narra las peripecias del conserje de un elegante hotel europeo y su aprendiz. Con una duración de poco menos de dos horas, la película te llevará a un mundo de personajes excéntricos, situaciones cómicas y aventuras inesperadas en un hotel de lujo."
    }
  ]
}